// @ts-nocheck
import Settings from "../settings/Settings";
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// BEN-ROM TRANSLITERATION SECTION --
// transliterate bengali song written in bangla to roman
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

var bb_ind_vwl = ['অ','আ','ই','ঈ','উ','ঊ','ঋ','ৠ','ঌ','ৡ','এ','ঐ','ও','ঔ'];
var bb_depend_vwl = ['া','ি','ী','ু','ূ','ৃ','ৄ','ৢ','ৣ','ে','ৈ','ো','ৌ'];
var bb_con = ['ক','খ','গ','ঘ','ঙ','চ','ছ','জ','ঝ','ঞ','ট','ঠ','ড','ঢ','ণ','ড়','ঢ়','ত','থ','দ','ধ','ন','প','ফ','ব','ভ','ম','য','য়','র','ল','ৱ','শ','ষ','স','হ'];

bb_ind_vwl = bb_ind_vwl.join('|');
bb_depend_vwl = bb_depend_vwl.join('|');
bb_con = bb_con.join('|');

var bb_interpuncterfy = ['অ'].concat(bb_con).concat(['ঁ']).join('|');

var t_bb_ind_vwl_n = {'অঁ':'ã','আঁ':'ā̃','ইঁ':'ĩ','ঈঁ':'ī̃','উঁ':'ũ','ঊঁ':'ū̃','এঁ':'ẽ','ঐঁ':'aĩ','ওঁ':'õ','ঔঁ':'aũ'};
var t_bb_ind_vwl = {'অ':'a','আ':'ā','ই':'i','ঈ':'ī','উ':'u','ঊ':'ū','ঋ':'ṛ','ৠ':'ṝ','ঌ':'ḷ','ৡ':'ḹ','এ':'e','ঐ':'ai','ও':'o','ঔ':'au','ং':'ṁ','ঃ':'ḥ'};
var t_bb_dpd_vwl_n = {'াঁ':'ā̃','িঁ':'ĩ','ীঁ':'ī̃','ুঁ':'ũ','ূঁ':'ū̃','েঁ':'ẽ','ৈঁ':'aĩ','োঁ':'o','ৌঁ':'aũ'};
var t_bb_dpd_vwl = {'া':'ā','ি':'i','ী':'ī','ু':'u','ূ':'ū','ৃ':'ṛ','ৄ':'ṝ','ৢ':'ḷ','ৣ':'ḹ','ে':'e','ৈ':'ai','ো':'o','ৌ':'au'};
var t_bb_con = {'ক্':'k','কঁ':'kã','ক':'ka','খ্':'kh','খঁ':'khã','খ':'kha','গ্':'g','গঁ':'gã','গ':'ga','ঘ্':'gh','ঘঁ':'ghã','ঘ':'gha','ঙ্':'ṅ','ঙ':'ṅa',
             'চ্':'c','চঁ':'cã','চ':'ca','ছ্':'ch','ছঁ':'chã','ছ':'cha','জ্':'j','জঁ':'jã','জ':'ja','ঝ্':'jh','ঝঁ':'jhã','ঝ':'jha','ঞ্':'ñ','ঞ':'ña','জ্ঞ':'jña','জ্ঞ্':'jñ',
             'ত্':'t','তঁ':'tã','ত':'ta','থ্':'th','থঁ':'thã','থ':'tha','দ্':'d','দঁ':'dã','দ':'da','ধ্':'dh','ধঁ':'dhã','ধ':'dha','ন্':'n','নঁ':'nã','ন':'na','ৎ':'t',
             'ট্':'ṭ','টঁ':'ṭã','ট':'ṭa','ঠ্':'ṭh','ঠঁ':'ṭhã','ঠ':'ṭha','ড্':'ḍ','ডঁ':'ḍã','ড':'ḍa','ঢ্':'ḍh','ঢঁ':'ḍhã','ঢ':'ḍha','ণ্':'ṇ','ণ':'ṇa','ড়্':'ḓ','ড়ঁ':'ḓã','ড়':'ḓa','ঢ়্':'ḓh','ঢ়ঁ':'ḓhã','ঢ়':'ḓha',
             'প্':'p','পঁ':'pã','প':'pa','ফ্':'ph','ফঁ':'phã','ফ':'pha','ব্':'b','বঁ':'bã','ব':'ba','ভ্':'bh','ভঁ':'bhã','ভ':'bha','ম্':'m','মঁ':'mã','ম':'ma',
             'য্':'y','যঁ':'yã','য':'ya','য়্':'y','য়ঁ':'yã','য়':'ya','র্':'r','রঁ':'rã','র':'ra','ল্':'l','লঁ':'l ̌','ল':'la','ৱ্':'v','ৱঁ':'vã','ৱ':'va',
             'শ্':'ś','শঁ':'śã','শ':'śa','ষ্':'ṣ','ষঁ':'ṣã','ষ':'ṣa','স্':'s','সঁ':'sã','স':'sa','হ্':'h','হঁ':'hã','হ':'ha'};
var t_bb_num = {'০':'0','১':'1','২':'2','৩':'3','৪':'4','৫':'5','৬':'6','৭':'7','৮':'8','৯':'9'};

function transBenRom(str){
  if(!str) return "";

  var regexA = new RegExp(`(${bb_interpuncterfy})(ই|উ)`, "g");
  var regexB = new RegExp(`(${bb_con})(${bb_depend_vwl})`, "g");
  var regexC = new RegExp('([kgṅcjñṭḍṇtdnpbmyrlśṣsh])(y)', "g");

  str = str.replace(regexA, function(m,g1,g2){ return `${g1}·${g2}`; });
  for(var key in t_bb_ind_vwl_n) str = str.replace(new RegExp(key,"g"), t_bb_ind_vwl_n[key]);
  for(var key in t_bb_ind_vwl)   str = str.replace(new RegExp(key,"g"), t_bb_ind_vwl[key]);

  str = str.replace(regexB, function(m,g1,g2){ return `${g1}্${g2}`; });
  for(var key in t_bb_dpd_vwl_n) str = str.replace(new RegExp(key,"g"), t_bb_dpd_vwl_n[key]);
  for(var key in t_bb_dpd_vwl)   str = str.replace(new RegExp(key,"g"), t_bb_dpd_vwl[key]);
  for(var key in t_bb_con)       str = str.replace(new RegExp(key,"g"), t_bb_con[key]);

//   str = str.replace(regexC, function(m,g1){ return `${g1}ẏ`; });
  str = str.replace('ঽ','’');

  for(var key in t_bb_num) str = str.replace(new RegExp(key,"g"), t_bb_num[key]);

  return str;
}




//---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// BEN-INDIC TRANSLITERATION SECTION --
// transliterate from bangla --> TO INDIC SCRIPTS
//---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

var t_ben = {}

t_ben.san =
t_ben.dev = {"অ":"अ", "আ":"आ", "ই":"इ", "ঈ":"ई", "উ":"उ", "ঊ":"ऊ", "ঋ":"ऋ", "ৠ":"ॠ", "ঌ":"ऌ", "ৡ":"ॡ",
"এ":"ए", "ঐ":"ऐ", "ও":"ओ", "ঔ":"औ",
"া":"ा", "ি":"ि", "ী":"ी", "ু":"ु", "ূ":"ू", "ৃ":"ृ", "ৄ":"ॄ", "ৢ":"ॢ", "ৣ":"ॣ",
"ে":"े", "ৈ":"ै", "ো":"ो", "ৌ":"ौ",
"ং":"ं", "ঃ":"ः", "ঁ":"ँ", "ঽ":"ऽ", "্":"्",
"ঁ":"ं",
"ক":"क", "খ":"ख", "গ":"ग", "ঘ":"घ", "ঙ":"ङ",
"চ":"च", "ছ":"छ", "জ":"ज", "ঝ":"झ", "ঞ":"ञ",
"ত":"त", "থ":"थ", "দ":"द", "ধ":"ध", "ন":"न", "ৎ":"त्",
"ট":"ट", "ঠ":"ठ", "ড":"ड", "ঢ":"ढ", "ণ":"ण", "ড়":"ड़", "ঢ়":"ढ़",
"প":"प", "ফ":"फ", "ব":"ब", "ভ":"भ", "ম":"म",
"য":"य", "য়":"य", "র":"र", "ল":"ल", "ৱ":"व",
"শ":"श", "ষ":"ष", "স":"स", "হ":"ह",
"০":"०", "১":"१", "২":"२", "৩":"३", "৪":"४", "৫":"५", "৬":"६", "৭":"७", "৮":"८", "৯":"९"}

t_ben.odi = {"অ":"ଅ", "আ":"ଆ", "ই":"ଇ", "ঈ":"ଈ", "উ":"ଉ", "ঊ":"ଊ", "ঋ":"ଋ", "ৠ":"ୠ", "ঌ":"ଌ", "ৡ":"ୡ",
"এ":"ଏ", "ঐ":"ଐ", "ও":"ଓ", "ঔ":"ଔ",
"া":"ା", "ি":"ି", "ী":"ୀ", "ু":"ୁ", "ূ":"ୂ", "ৃ":"ୃ", "ৄ":"ୄ", "ৢ":"ୢ", "ৣ":"ୣ",
"ে":"େ", "ৈ":"ୈ", "ো":"ୋ", "ৌ":"ୌ",
"ং":"ଂ", "ঃ":"ଃ", "ঁ":"ଁ", "ঽ":"ଽ", "্":"୍",
"ক":"କ", "খ":"ଖ", "গ":"ଗ", "ঘ":"ଘ", "ঙ":"ଙ",
"চ":"ଚ", "ছ":"ଛ", "জ":"ଜ", "ঝ":"ଝ", "ঞ":"ଞ",
"ত":"ତ", "থ":"ଥ", "দ":"ଦ", "ধ":"ଧ", "ন":"ନ", "ৎ":"ତ୍",
"ট":"ଟ", "ঠ":"ଠ", "ড":"ଡ", "ঢ":"ଢ", "ণ":"ଣ", "ড়":"ଡ଼", "ঢ়":"ଢ଼",
"প":"ପ", "ফ":"ଫ", "ব":"ବ", "ভ":"ଭ", "ম":"ମ",
"য":"ଯ", "য়":"ୟ", "র":"ର", "ল":"ଲ", "ৱ":"ବ",
"শ":"ଶ", "ষ":"ଷ", "স":"ସ", "হ":"ହ",
"০":"୦", "১":"୧", "২":"୨", "৩":"୩", "৪":"୪", "৫":"୫", "৬":"୬", "৭":"୭", "৮":"୮", "৯":"୯"}

t_ben.kan = {"অ":"ಅ", "আ":"ಆ", "ই":"ಇ", "ঈ":"ಈ", "উ":"ಉ", "ঊ":"ಊ", "ঋ":"ಋ", "ৠ":"ೠ", "ঌ":"ಌ", "ৡ":"ೡ",
"এ":"ಏ", "ঐ":"ಐ", "ও":"ಓ", "ঔ":"ಔ",
"া":"ಾ", "ি":"ಿ", "ী":"ೀ", "ু":"ು", "ূ":"ೂ", "ৃ":"ೃ", "ৄ":"ೄ", "ৢ":"ೢ", "ৣ":"ೣ",
"ে":"ೇ", "ৈ":"ೈ", "ো":"ೋ", "ৌ":"ೌ",
"ং":"ಂ", "ঃ":"ಃ", "ঁ":"ँ", "ঽ":"ಽ", "্":"್",
"ক":"ಕ", "খ":"ಖ", "গ":"ಗ", "ঘ":"ಘ", "ঙ":"ಙ",
"চ":"ಚ", "ছ":"ಛ", "জ":"ಜ", "ঝ":"ಝ", "ঞ":"ಞ",
"ত":"ತ", "থ":"ಥ", "দ":"ದ", "ধ":"ಧ", "ন":"ನ", "ৎ":"ತ್",
"ট":"ಟ", "ঠ":"ಠ", "ড":"ಡ", "ঢ":"ಢ", "ণ":"ಣ", "ড়":"ಡ", "ঢ়":"ಢ",
"প":"ಪ", "ফ":"ಫ", "ব":"ಬ", "ভ":"ಭ", "ম":"ಮ",
"য":"ಯ", "য়":"ಯ", "র":"ರ", "ল":"ಲ", "ৱ":"ವ",
"শ":"ಶ", "ষ":"ಷ", "স":"ಸ", "হ":"ಹ",
"০":"೦", "১":"೧", "২":"೨", "৩":"೩", "৪":"೪", "৫":"೫", "৬":"೬", "৭":"೭", "৮":"೮", "৯":"೯"}

t_ben.tel = {"অ":"అ", "আ":"ఆ", "ই":"ఇ", "ঈ":"ఈ", "উ":"ఉ", "ঊ":"ఊ", "ঋ":"ఋ", "ৠ":"ౠ", "ঌ":"ఌ", "ৡ":"ౡ",
"এ":"ఏ", "ঐ":"ఐ", "ও":"ఓ", "ঔ":"ఔ",
"া":"ా", "ি":"ి", "ী":"ీ", "ু":"ు", "ূ":"ూ", "ৃ":"ృ", "ৄ":"ౄ", "ৢ":"ౢ", "ৣ":"ౣ",
"ে":"ే", "ৈ":"ై", "ো":"ో", "ৌ":"ౌ",
"ং":"ం", "ঃ":"ః", "ঁ":"ఁ", "ঽ":"ఽ", "্":"్",
"ক":"క", "খ":"ఖ", "গ":"గ", "ঘ":"ఘ", "ঙ":"ఙ",
"চ":"చ", "ছ":"ఛ", "জ":"జ", "ঝ":"ఝ", "ঞ":"ఞ",
"ত":"త", "থ":"థ", "দ":"ద", "ধ":"ధ", "ন":"న", "ৎ":"త్",
"ট":"ట", "ঠ":"ఠ", "ড":"డ", "ঢ":"ఢ", "ণ":"ణ", "ড়":"డ", "ঢ়":"డ",
"প":"ప", "ফ":"ఫ", "ব":"బ", "ভ":"భ", "ম":"మ",
"য":"య", "য়":"య", "র":"ర", "ল":"ల", "ৱ":"వ",
"শ":"శ", "ষ":"ష", "স":"స", "হ":"హ",
"০":"౦", "১":"౧", "২":"౨", "৩":"౩", "৪":"౪", "৫":"౫", "৬":"౬", "৭":"౭", "৮":"౮", "৯":"౯"}

t_ben.guj = {"অ":"અ", "আ":"આ", "ই":"ઇ", "ঈ":"ઈ", "উ":"ઉ", "ঊ":"ઊ", "ঋ":"ઋ", "ৠ":"ૠ", "ঌ":"ઌ", "ৡ":"ૡ",
"এ":"એ", "ঐ":"ઐ", "ও":"ઓ", "ঔ":"ઔ",
"া":"ા", "ি":"િ", "ী":"ી", "ু":"ુ", "ূ":"ૂ", "ৃ":"ૃ", "ৄ":"ૄ", "ৢ":"ૢ", "ৣ":"ૣ",
"ে":"ે", "ৈ":"ૈ", "ো":"ો", "ৌ":"ૌ",
"ং":"ં", "ঃ":"ઃ", "ঁ":"ઁ", "ঽ":"ઽ", "্":"્",
"ক":"ક","খ":"ખ", "গ":"ગ", "ঘ":"ઘ", "ঙ":"ઙ",
"চ":"ચ", "ছ":"છ", "জ":"જ", "ঝ":"ઝ","ঞ":"ઞ",
"ত":"ત", "থ":"થ", "দ":"દ", "ধ":"ધ","ন":"ન", "ৎ":"ત્",
"ট":"ટ", "ঠ":"ઠ", "ড":"ડ", "ঢ":"ઢ", "ণ":"ણ", "ড়":"ડ", "ঢ়":"ઢ",
"প":"પ", "ফ":"ફ", "ব":"બ", "ভ":"ભ", "ম":"મ",
"য":"ય", "য়":"ય", "র":"ર", "ল":"લ", "ৱ":"વ",
"শ":"શ", "ষ":"ષ", "স":"સ", "হ":"હ",
"০":"૦", "১":"૧", "২":"૨", "৩":"૩", "৪":"૪", "৫":"૫", "৬":"૬", "৭":"૭", "৮":"૮", "৯":"૯"}

t_ben.pan = {"অ":"ਅ", "আ":"ਆ", "ই":"ਇ", "ঈ":"ਈ", "উ":"ਉ", "ঊ":"ਊ", "ঋ":"ਰਿ", "ৠ":"ਰਿ", "ঌ":"ਲ੍ਰਰਿ", "ৡ":"ਲ੍ਰਰਿ",
"এ":"ਏ", "ঐ":"ਐ", "ও":"ਓ", "ঔ":"ਔ",
"া":"ਾ", "ি":"ਿ", "ী":"ੀ", "ু":"ੁ", "ূ":"ੂ", "ৃ":"੍ਰਿ", "ৄ":"੍ਰਿ", "ৢ":"੍ਲ੍ਰਰਿ", "ৣ":"੍ਲ੍ਰਰਿ",
"ে":"ੇ", "ৈ":"ੈ", "ো":"ੋ", "ৌ":"ੌ",
"ং":"ਂ", "ঃ":"ਃ", "ঁ":"ਁ", "ঽ":"ऽ", "্":"੍",
"ক":"ਕ", "খ":"ਖ", "গ":"ਗ", "ঘ":"ਘ", "ঙ":"ਙ",
"চ":"ਚ", "ছ":"ਛ", "জ":"ਜ", "ঝ":"ਝ", "ঞ":"ਞ",
"ত":"ਤ", "থ":"ਥ", "দ":"ਦ", "ধ":"ਧ", "ন":"ਨ", "ৎ":"ਤ੍",
"ট":"ਟ", "ঠ":"ਠ", "ড":"ਡ", "ঢ":"ਢ", "ণ":"ਣ", "ড়":"ੜ", "ঢ়":"ੜ",
"প":"ਪ", "ফ":"ਫ", "ব":"ਬ", "ভ":"ਭ", "ম":"ਮ",
"য":"ਯ", "য়":"ਯ", "র":"ਰ", "ল":"ਲ", "ৱ":"ਵ",
"শ":"ਸ਼", "ষ":"ਸ਼", "স":"ਸ", "হ":"ਹ",
"০":"੦", "১":"੧", "২":"੨", "৩":"੩", "৪":"੪", "৫":"੫", "৬":"੬", "৭":"੭", "৮":"੮", "৯":"੯"}

t_ben.mal = {"অ":"അ", "আ":"ആ", "ই":"ഇ", "ঈ":"ഈ", "উ":"ഉ", "ঊ":"ഊ", "ঋ":"ഋ", "ৠ":"ൠ", "ঌ":"ഌ", "ৡ":"ൡ",
"এ":"ഏ", "ঐ":"ഐ", "ও":"ഓ", "ঔ":"ഔ",
"া":"ാ", "ি":"ി", "ী":"ീ", "ু":"ു", "ূ":"ൂ", "ৃ":"ൃ", "ৄ":"ൄ", "ৢ":"ൢ", "ৣ":"ൣ",
"ে":"േ", "ৈ":"ൈ", "ো":"ോ", "ৌ":"ൌ",
"ং":"ം", "ঃ":"ഃ", "ঁ":"ँ", "ঽ":"ഽ", "্":"്",
"ক":"ക", "খ":"ഖ", "গ":"ഗ", "ঘ":"ഘ", "ঙ":"ങ",
"চ":"ച", "ছ":"ഛ", "জ":"ജ", "ঝ":"ഝ", "ঞ":"ഞ",
"ত":"ത", "থ":"ഥ", "দ":"ദ", "ধ":"ധ", "ন":"ന", "ৎ":"ത്",
"ট":"ട", "ঠ":"ഠ", "ড":"ഡ", "ঢ":"ഢ", "ণ":"ണ", "ড়":"ഡ", "ঢ়":"ഢ",
"প":"പ", "ফ":"ഫ", "ব":"ബ", "ভ":"ഭ", "ম":"മ",
"য":"യ", "য়":"യ", "র":"ര", "ল":"ല", "ৱ":"വ",
"শ":"ശ", "ষ":"ഷ", "স":"സ", "হ":"ഹ",
"০":"൦", "১":"൧", "২":"൨", "৩":"൩", "৪":"൪", "৫":"൫", "৬":"൬", "৭":"൭", "৮":"൮", "৯":"൯"}

t_ben.tam = {"অ":"அ", "আ":"ஆ", "ই":"இ", "ঈ":"ஈ", "উ":"உ", "ঊ":"ஊ", "ঋ":"ரி", "ৠ":"ரி", "ঌ":"ல்ரி", "ৡ":"ல்ரி",
"এ":"ஏ", "ঐ":"ஐ", "ও":"ஓ", "ঔ":"ஔ",
"া":"ா", "ি":"ி", "ী":"ீ", "ু":"ு", "ূ":"ூ", "ৃ":" ்ரி", "ৄ":" ்ரி", "ৢ":" ்ல்ரி", "ৣ":" ்ல்ரி",
"ে":"ே", "ৈ":"ை", "ো":"ோ", "ৌ":"ௌ",
"ং":"ஂ", "ঃ":"ஃ", "ঁ":"ँ", "ঽ":"ऽ", "্":"்",
"ক":"க", "খ":"க", "গ":"க", "ঘ":"க", "ঙ":"ங",
"চ":"ச", "ছ":"ச", "জ":"ஜ", "ঝ":"ச", "ঞ":"ஞ",
"ত":"த", "থ":"த", "দ":"த", "ধ":"த", "ন":"ந", "ৎ":"த்",
"ট":"ட", "ঠ":"ட", "ড":"ட", "ঢ":"ட", "ণ":"ண", "ড়":"ர", "ঢ়":"ர",
"প":"ப", "ফ":"ப", "ব":"ப", "ভ":"ப", "ম":"ம",
"য":"ய", "য়":"ய", "র":"ர", "ল":"ல", "ৱ":"வ",
"শ":"ஶ", "ষ":"ஷ", "স":"ஸ", "হ":"ஹ",
"০":"௦", "১":"௧", "২":"௨", "৩":"௩", "৪":"௪", "৫":"௫", "৬":"௬", "৭":"௭", "৮":"௮", "৯":"௯"}

function transBenIndic(str, script){ return regexConvert(str, t_ben[script]) }




//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ROM-RUS TRANSLITERATION SECTION --
// transliterate roman -> TO RUSSIAN
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

var t_rom_rus = {"i":"и","ī":"ӣ","u":"у","ū":"ӯ","ṛ":"р̣","ṝ":"р̣̄","ḷ":"лр̣","ḷ":"лр̣",
"ai":"ай","o":"о","au":"ау",

"ṁ":"м̇","ḥ":"х̣",
"k":"к","g":"г","ṅ":"н̇",
"c":"ч","j":"дж","ñ":"н̃",
"t":"т","d":"д","n":"н",
"ṭ":"т̣","ḍ":"д̣","ṇ":"н̣","ḓ":"д̣",
"p":"п","b":"б","m":"м",
"y":"й","r":"р","l":"л","v":"в",
"ś":"ш́","ṣ":"ш","s":"с","h":"х",

"^e":"э"
}

function transRomRus(str){ return regexConvert(str, t_rom_rus) }





//---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// COMMON SECTION
//---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

export default function transliterate(str, songLang, targetLang="user"){
  if (!str) return "";

  const userLanguage = Settings.get().userLanguage;

  if (targetLang === "user") targetLang = userLanguage;
  if (targetLang === "ger") targetLang = "eng"
  if (targetLang === "spa") targetLang = "eng"
  if (targetLang === "hin") targetLang = "dev"
  if (songLang === "hin") songLang = "dev"
  if (songLang === "ori") songLang = "ben"
  if (songLang === "asa") songLang = "ben"

  if (["eng", "rus", "spa", "ger"].indexOf(targetLang) > -1) {
    str = str.replace(/_/g, '-').replace(/•/g, ' ')
      .replace(/॥([০১২৩৪৫৬৭৮৯]+)॥/g, (m,a)=>{ return `(${a})` }).replace(/।/g, '');
  }
  else if (songLang !== "dev") str = str.replace(/_/g, '').replace(/•/g, '');

  if (targetLang === "ben") return str.replace(/ৱ/g, 'ব');

  str = str.replace(/ঞি/g, 'ইঁ');
  str = str.replace(/ঞী/g, 'ইঁ');
  str = str.replace(/ঞা/g, 'য়া');

  str = str.replace(/ড়/g, 'ড়');
  str = str.replace(/ঢ়/g, 'ঢ়');
  str = str.replace(/য়/g, 'য়');
  str = str.replace(/ব়/g, 'র');

  str = str.replace(/ড়/g, 'ড়');
  str = str.replace(/ঢ়/g, 'ঢ়');
  str = str.replace(/য়/g, 'য়');
  str = str.replace(/ব়/g, 'র');
  str = str.replace(/ো/g, 'ো');
  str = str.replace(/ৌ/g, 'ৌ');

  var separators = " -!?,.()’~‘\"•_"; // "
  var output="";
  var word="";
  var z=str.length-1;

  function transliterateWord(){
    const isIndicSong = Object.keys(t_ben).indexOf(songLang) > -1
    const isIndicTarget = Object.keys(t_ben).indexOf(targetLang) > -1

    if(songLang==="ben" && isIndicTarget) word = transBenIndic(word, targetLang);
    if(songLang==="ben" && targetLang==="eng") word = transBenRom(word);
    if(songLang==="ben" && targetLang==="rus") word = transRomRus(transBenRom(word));
    if(songLang==="dev" && targetLang==="ben_convert") word = devConvert(word);

    if(isIndicSong && targetLang==="ben") word = word; // <-- code execution should never land here
    if(isIndicSong && isIndicTarget) word = transBenIndic(word, targetLang);   // same as #1
    if(isIndicSong && targetLang==="eng") word = transBenRom(word);             // same as #2
    if(isIndicSong && targetLang==="rus") word = transRomRus(transBenRom(word)); // same as #3

    word = word.replace(/rtt/g, "rt");
    word = word.replace(/rmm/g, "rm");
    word = word.replace(/rbb/g, "rb");
    word = word.replace(/rvv/g, "rv");
    word = word.replace(/rdd/g, "rd");
    word = word.replace(/rkk/g, "rk");
    word = word.replace(/rjj/g, "rj");
    word = word.replace(/ryy/g, "ry");
    word = word.replace(/rẏy/g, "rẏ");
    word = word.replace(/jĩ/g, "jñī");
    word = word.replace(/jyā/g, "jñā");
  }

  for(var c=0; c<=z; c++){
    word+=str[c];
    if(separators.indexOf(str[c])!=-1){
      var fc=str[c]; // finishing character (i.e. punctuation)
      word=word.substr(0,word.length-1);
      transliterateWord();
      output+=word+fc;
      word="";
    }
    else if(c==z){
      // last word in a phrase ...no finishing character
      word=word.substr(0,word.length);
      transliterateWord();
      output+=word;
      word="";
    }
  }

  return output;
}

function regexConvert(str, hashTable){
  if(!str) return "";
  for (rule in hashTable) {
    replaceWith = hashTable[rule]
    regx = new RegExp(rule, "g");
    str = str.replace(regx, replaceWith)
  }
  return str.split('').map(c=>{
    return hashTable[c] || c
  }).join('');
}
